In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [3]:
dict1={'Names':['Ram','Sita','Lakshman',None],
      'Age':[30,31,None,33],
      'City':[None,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

      Names   Age     City
0       Ram  30.0     None
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3      None  33.0  Chennai

In [5]:
dict1={'Names':['Ram','Sita','Lakshman','Null'],
      'Age':[30,31,'Null',33],
      'City':['Null','Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

      Names   Age     City
0       Ram    30     Null
1      Sita    31      Hyd
2  Lakshman  Null     Pune
3      Null    33  Chennai

- None and Null is not recommended
- np.nan is only recommended

In [7]:
# Recommended

dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

$Method-1:$

- Fill with a random number to all null values

In [8]:
df.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [11]:
df.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [12]:
df.isnull().count()

Names    4
Age      4
City     4
dtype: int64

In [13]:
df.isna()    # is null an isna both work as same

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [15]:
df.isnull().sum().count()

3

**Fillna**

In [18]:
df.fillna(40,inplace=True)
df

      Names   Age     City
0       Ram  30.0       40
1      Sita  31.0      Hyd
2  Lakshman  40.0     Pune
3        40  33.0  Chennai

In [20]:
df.dtypes

Names     object
Age      float64
City      object
dtype: object

In [21]:
dict(df.dtypes)

{'Names': dtype('O'), 'Age': dtype('float64'), 'City': dtype('O')}

**Method:-2**
    
- fill the random value by using column wise

In [32]:
###########################Read the data again#############################
dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [33]:
df['Names'].fillna('Raheem',inplace=True)
df['Age'].fillna(45,inplace=True)
df['City'].fillna('Mumbai',inplace=True)

In [34]:
df

      Names   Age     City
0       Ram  30.0   Mumbai
1      Sita  31.0      Hyd
2  Lakshman  45.0     Pune
3    Raheem  33.0  Chennai

**Method:-3**
    
- pad

- bfill

- backfill

- ffill

In [35]:
################## Read the Data again############################

dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [36]:
df.fillna(method='pad')

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman  31.0     Pune
3  Lakshman  33.0  Chennai

In [38]:
#print('===================original=================')
#print(df)
print('============pad========================')
print(df.fillna(method='pad'))

============pad========================
      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman  31.0     Pune
3  Lakshman  33.0  Chennai

In [39]:
dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [41]:
df.fillna(method='bfill')

      Names   Age     City
0       Ram  30.0      Hyd
1      Sita  31.0      Hyd
2  Lakshman  33.0     Pune
3       NaN  33.0  Chennai

In [42]:
dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [43]:
df.fillna(method='backfill')

      Names   Age     City
0       Ram  30.0      Hyd
1      Sita  31.0      Hyd
2  Lakshman  33.0     Pune
3       NaN  33.0  Chennai

In [44]:
dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [45]:
df.fillna(method='ffill')

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman  31.0     Pune
3  Lakshman  33.0  Chennai

In [46]:
dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [52]:
df.fillna(method='bfill',axis=1)

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman  Pune     Pune
3      33.0  33.0  Chennai

In [53]:
df.fillna(method='pad',axis=1)

      Names       Age     City
0       Ram      30.0     30.0
1      Sita      31.0      Hyd
2  Lakshman  Lakshman     Pune
3       NaN      33.0  Chennai

In [54]:
# KNN imputer in machine learning

**Method:-4**
    
- Mean

- Median

- Mode

In [56]:
######################### Read the data Again #############################

dict1={'Names':['Ram','Sita','Lakshman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

      Names   Age     City
0       Ram  30.0      NaN
1      Sita  31.0      Hyd
2  Lakshman   NaN     Pune
3       NaN  33.0  Chennai

In [58]:
mean_age=df['Age'].mean()
df['Age'].fillna(mean_age)

0    30.000000
1    31.000000
2    31.333333
3    33.000000
Name: Age, dtype: float64

In [59]:
median_age=df['Age'].median()
df['Age'].fillna(median_age)

0    30.0
1    31.0
2    31.0
3    33.0
Name: Age, dtype: float64

- Mode is used for categorical data

- Mean and Median is used for numerical data